tgv2dTests/tgv2d/TGV_temporal/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8064;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8128;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    top
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8192;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom;
    }
    bottom
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8256;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top;
    }
    ignore
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8192;
        startFace       8320;
    }
)

// ************************************************************************* //
